---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CorrectionFactorSet.Clear
source: html/faf177f8-494c-4d37-659a-3ef800155a8e.htm
---
# Autodesk.Revit.DB.Electrical.CorrectionFactorSet.Clear Method

Removes every correction factor from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```